In [1]:
%run ../utils/init_env.py

In [ ]:
import sqlite3
import json
import os
import pandas as pd
import nltk

In [18]:
DB_PATH = "/Users/atissera/Developer/repos/unrc-cs-thesis/spider_data/test_database"
GOLD_SQL = "/Users/atissera/Developer/repos/unrc-cs-thesis/data/gold_queries_benchmark.sql"
PRED_SQL = "/Users/atissera/Developer/repos/unrc-cs-thesis/data/predicted_queries_benchmark.sql"

In [19]:
with open(GOLD_SQL) as f:
    glist = [l.strip().split('\t') for l in f.readlines() if len(l.strip()) > 0]

with open(PRED_SQL) as f:
    plist = [l.strip().split('\t') for l in f.readlines() if len(l.strip()) > 0]

In [ ]:

for pred, gold in zip(plist, glist):
    db_id = gold[-1]
    query = pred[0]
    db_file = os.path.join(DB_PATH, db_id, db_id + ".sqlite")
    if not os.path.exists(db_file):
        print(f"❌ Database file not found: {db_file}")
        continue

    try:
        conn = sqlite3.connect(db_file)
        cursor = conn.cursor()
        cursor.execute(query)
        columns = [description[0] for description in cursor.description]
        rows = cursor.fetchall()
        conn.close()

        result_df = pd.DataFrame(rows, columns=columns)
        print(f"📌 Database: {db_id} | Query:\n{query}")
        display(result_df)
    except Exception as e:
        print(f"❌ Error running query on {db_id}: {query}")
        print(e)

📌 Database: pilot_1 | Query:
SELECT COUNT(*) FROM PilotSkills WHERE age > 40 OR age < 30

   COUNT(*)
0         8

📌 Database: bakery_1 | Query:
SELECT MIN(Price) FROM goods WHERE Flavor LIKE '%cheese%'

   MIN(Price)
0        1.75

📌 Database: region_building | Query:
SELECT MAX(Number_of_Stories) FROM building WHERE Completed_Year <> 1980

   MAX(Number_of_Stories)
0                      36

📌 Database: online_exams | Query:
SELECT Type_of_Question_Code FROM Questions GROUP BY Type_of_Question_Code HAVING COUNT(Question_ID) >= 3

  Type_of_Question_Code
0       Multiple Choice
1         Single Choice

📌 Database: cre_Students_Information_Systems | Query:
SELECT S.bio_data, A.address_details FROM Students AS S JOIN Students_Addresses AS SA ON S.student_id = SA.student_id JOIN Addresses AS A ON SA.address_id = A.address_id

    bio_data                   address_details
0    Keshawn          222 Chase Union Apt. 747
1      Leora           41082 Calista Mountains
2    Houston                 564 Aaliyah Trace
3   Louvenia  90147 Greenholt Springs Apt. 497
4     Edison                 564 Aaliyah Trace
5     Edison         033 Robel Courts Apt. 312
6    Houston                7127 Ressie Plains
7    Houston          222 Chase Union Apt. 747
8    Houston         033 Robel Courts Apt. 312
9   Louvenia         607 Nikita Cape Suite 449
10    Antone     423 Rosenbaum Shores Apt. 812
11    Antone                 4240 Enrico Grove
12     Leora           41082 Calista Mountains
13    Camila        33376 Terry Mews Suite 922
14  Louvenia                 564 Aaliyah Trace

❌ Error running query on government_shift: SELECT c.Customer_ID, c.Customer_Details FROM Customers c JOIN Customer_Interactions ci ON c.Customer_ID = ci.Customer_ID WHERE ci.Status_Code = 'Stuck' AND ci.Services_and_Channels_Details = 'bad' This query retrieves the details of customers who have been involved in interactions with a status code of "Stuck" and where both service and channel details are marked as "bad".
near "This": syntax error
📌 Database: boat_1 | Query:
SELECT bid, COUNT(*) AS reservation_count FROM Reserves WHERE bid > 50 GROUP BY bid

   bid  reservation_count
0  102                  2
1  103                  2

📌 Database: movie_2 | Query:
SELECT COUNT(*) FROM Movies WHERE Rating IS NOT NULL

   COUNT(*)
0         5

📌 Database: book_1 | Query:
SELECT AVG(SalePrice) FROM Book WHERE Author IN ( SELECT idAuthor FROM Author WHERE Name = 'George Orwell' )

  AVG(SalePrice)
0           None

📌 Database: vehicle_rent | Query:
SELECT AVG(age) FROM Customers WHERE membership_credit > (SELECT AVG(membership_credit) FROM Customers)

   AVG(age)
0      63.0

📌 Database: e_commerce | Query:
SELECT o.date_order_placed FROM Orders o JOIN ( SELECT customer_id FROM Customer_Payment_Methods GROUP BY customer_id HAVING COUNT(payment_method_code) >= 2 ) cp ON o.customer_id = cp.customer_id

     date_order_placed
0  2017-10-14 12:05:48
1  2017-09-10 08:27:04
2  2018-03-01 04:18:28
3  2017-09-25 14:30:23
4  2017-12-10 23:45:42

📌 Database: soccer_3 | Query:
SELECT Manufacturer FROM club GROUP BY Manufacturer ORDER BY COUNT(*) DESC LIMIT 1

  Manufacturer
0        Umbro

📌 Database: bbc_channels | Query:
SELECT COUNT(*) FROM channel c WHERE NOT EXISTS ( SELECT 1 FROM program p WHERE p.Channel_ID = c.Channel_ID )

   COUNT(*)
0        10

📌 Database: boat_1 | Query:
SELECT rating, AVG(age) FROM Sailors s JOIN Reserves r ON s.sid = r.sid JOIN Boats b ON r.bid = b.bid WHERE color = 'red' GROUP BY rating

   rating  AVG(age)
0       2      39.0

📌 Database: conference | Query:
SELECT DISTINCT s.name FROM staff s JOIN conference_participation cp1 ON s.staff_ID = cp1.staff_ID AND cp1.role = 'Speaker' JOIN conference_participation cp2 ON s.staff_ID = cp2.staff_ID AND cp2.role = 'Sponsor'

          name
0  Bobby Jones

📌 Database: cre_Students_Information_Systems | Query:
SELECT sa.date_from, sa.date_to FROM Students_Addresses sa JOIN (SELECT student_id FROM Transcripts GROUP BY student_id HAVING COUNT(*) = 2) t ON sa.student_id = t.student_id

                 date_from                  date_to
0  2015-03-14 15:55:46.000  2018-03-08 08:41:07.000
1  2011-04-29 03:20:26.000  2018-03-02 04:33:35.000
2  2012-12-17 20:22:50.000  2018-03-22 10:12:26.000
3  2009-06-21 04:28:15.000  2018-03-04 23:55:53.000